Revit 2023 API
MassZone.CutByUpperLevel Property
 Indicates the relationship between the MassZone and its upper level.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2012
Syntax
C#
public MassZoneLevelCutState CutByUpperLevel { get; }
Visual Basic
Public ReadOnly Property CutByUpperLevel As MassZoneLevelCutState
	Get
Visual C++
public:
property MassZoneLevelCutState CutByUpperLevel {
	MassZoneLevelCutState get ();
}
See Also
MassZone Class
Autodesk.Revit.DB.Analysis Namespace